// Задача 25: опишите метод, который принимает на вход два числа (A и B) и возводит число A в целую степень B.

// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16

// без math.pow

Console.WriteLine("Задача 25. Возведене числа A в натуральную степень B");